def area(a,b):
    '''
    Вычисляет площадь прямоугольника с заданными сторонами.

    Ввод: a (float) - сторона 1, b (float) - сторона 2
    Вывод: area (float) - площадь

    Пример использования:
    area(2,4) = 8
    '''
    return a*b

def perimeter(a,b):
    '''
    Вычисляет периметр прямоугольника с заданными сторонами.

    Ввод: a (float) - сторона 1, b (float) - сторона 2
    Вывод: perimeter (float) - периметр

    Пример использования:
    perimeter(2,4) = 12
    '''
    return 2*(a+b)

def diag(a,b):
    '''
    Вычисляет длину диагонали прямоугольника с заданными сторонами.

    Ввод: a (float) - сторона 1, b (float) - сторона 2
    Вывод: diag (float) - длина диагонали

    Пример использования:
    diag(3,4) = 5.0
    '''
    return (a**2+b**2)**0.5