def is_triangle(a,b,c):
    '''
    Проверяет, можно ли построить треугольник с заданными сторонами.

    Ввод: a (float) - сторона 1, b (float) - сторона 2, c (float) - сторона 3
    Вывод: is_triangle (bool) - True, если треугольник существует, иначе False

    Пример использования:
    is_triangle(3,4,5) = True
    '''
    return (a + b > c) and (a + c > b) and (b + c > a)

def area(a,b,c):
    '''
    Вычисляет площадь треугольника с заданными сторонами по формуле Герона.

    Ввод: a (float) - сторона 1, b (float) - сторона 2, c (float) - сторона 3
    Вывод: area (float) - площадь (0, если треугольник не существует)

    Пример использования:
    area(3,4,5) = 6.0
    '''
    if is_triangle:
        p=(a+b+c)/2
        return (p*(p-a)*(p-b)*(p-c))**0.5
    return 0

def perimiter(a,b,c):
    '''
    Вычисляет периметр треугольника с заданными сторонами.

    Ввод: a (float) - сторона 1, b (float) - сторона 2, c (float) - сторона 3
    Вывод: perimiter (float) - периметр

    Пример использования:
    perimiter(3,4,5) = 12
    '''
    return a+b+c


